#include "hos_05.h"
#include "model.h"
#include "effects.h"
#include "nu/nusys.h"
#include "ld_addrs.h"

typedef struct UnkHosStruct {
    /* 0x00 */ s32 unk_00; // entity ID
    /* 0x04 */ IMG_PTR unk_04;
    /* 0x08 */ PAL_PTR unk_08;
    /* 0x0C */ IMG_PTR unk_0C;
    /* 0x10 */ PAL_PTR unk_10;
    /* 0x14 */ char unk_14[0x4];
    /* 0x18 */ IMG_PTR unk_18;
    /* 0x1C */ IMG_PTR unk_1C;
    /* 0x20 */ PAL_PTR unk_20;
    /* 0x24 */ char unk_24[0x18];
    /* 0x3C */ s16 unk_3C;
    /* 0x3E */ s16 unk_3E;
    /* 0x40 */ s16 unk_40;
    /* 0x42 */ s16 unk_42;
    /* 0x44 */ u16 unk_44; // x
    /* 0x46 */ u16 unk_46; // y
    /* 0x48 */ s16 unk_48; // x
    /* 0x4A */ s16 unk_4A; // y
    /* 0x4C */ char unk_4C[0xC];
    /* 0x58 */ s16 unk_58; // bool
    /* 0x5A */ s16 unk_5A;
    /* 0x5C */ s16 unk_5C; // alpha
    /* 0x60 */ char unk_6E[0x2];
} UnkHosStruct; // size = 0x60

extern s32 D_802495DC_A3381C;
extern s32 D_802495E0_A33820;
extern f32 D_8024963C_A3387C[];
extern f32 D_8024987C_A33ABC;
extern f32 D_802498A8_A33AE8;
extern f32 D_802498D0_A33B10;
extern u16* D_802498D4_A33B14;
extern f32 D_802498D8_A33B18;
extern f32 D_802498DC_A33B1C;
extern f32 D_802498E0_A33B20;
extern f32 D_802498E4_A33B24;
extern f32 D_802498E8_A33B28;
extern f32 D_802498EC_A33B2C;
extern f32 D_802498F0_A33B30;
extern f32 D_802498F4_A33B34;
extern s32 D_802498F8_A33B38;
extern s32 D_802498FC_A33B3C;
extern s32 D_80249900_A33B40;
extern f32 D_80249904_A33B44;
extern s32 D_80249908_A33B48;
extern f32 D_8024990C_A33B4C;
extern s32 D_80249910_A33B50;
extern s16 D_80249914_A33B54[];
extern s16 D_80249934_A33B74[];
extern s32 D_8024995C_A33B9C;
extern s16 D_80249960_A33BA0[];
extern f32 D_80249980_A33BC0;
extern s32 D_80249984_A33BC4;
extern s16 D_80249988_A33BC8[];
extern s16 D_802499A8_A33BE8[][2];
