#include "hos_05.h"
#include "effects.h"
#include "model.h"
#include "nu/nusys.h"
#include "ld_addrs.h"

typedef struct StoryGraphicData {
    /* 0x00 */ s32 workerID; // entity ID
    /* 0x04 */ IMG_PTR imgFront;
    /* 0x08 */ PAL_PTR palFront;
    /* 0x0C */ IMG_PTR imgBack;
    /* 0x10 */ PAL_PTR palBack;
    /* 0x14 */ char unk_14[0x4];
    /* 0x18 */ IMG_PTR imgTape;
    /* 0x1C */ IMG_PTR imgBowser;
    /* 0x20 */ PAL_PTR palBowser;
    /* 0x24 */ char unk_24[0x18];
    /* 0x3C */ s16 frontImgPosX;
    /* 0x3E */ s16 frontImgPosY;
    /* 0x40 */ s16 backImgPosX;
    /* 0x42 */ s16 backImgPosY;
    /* 0x44 */ u16 silhouettePosX; // x
    /* 0x46 */ u16 silhouettePosY; // y
    /* 0x48 */ s16 tapePosX; // x
    /* 0x4A */ s16 tapePosY; // y
    /* 0x4C */ char unk_4C[0xC];
    /* 0x58 */ s16 flipOrder; // bool
    /* 0x5A */ s16 unk_5A;
    /* 0x5C */ s16 tapeAlpha; // alpha
    /* 0x60 */ char unk_6E[0x2];
} StoryGraphicData; // size = 0x60

s32 N(missing_802494FC_94FC)[] = {
    0x64, 0x63, 0x62, 0x60, 0x5E, 0x5C, 0x59, 0x57,
    0x54, 0x51, 0x4F, 0x4E, 0x4D, 0x4D, 0x4C, 0x4C,
    0x4C, 0x4C, 0x4D, 0x4D, 0x4E, 0x4E, 0x4F, 0x4F,
    0x50, 0x50, 0x51, 0x51, 0x52, 0x52, 0x53, 0x53,
    0x54, 0x54, 0x55, 0x55, 0x56, 0x56, 0x57, 0x57,
    0x58, 0x58, 0x59, 0x59, 0x5A, 0x5B, 0x5C, 0x5D,
    0x5E, 0x5F, 0x60, 0x61, 0x62, 0x63, 0x64, 
};

s32 N(D_802495DC_A3381C) = 0;

s32 N(D_802495E0_A33820) = 0;

CameraControlSettings N(IntroCamSettings0) = {
	.type = CAMERA_SETTINGS_TYPE_0,
	.boomLength = 130.4,
	.boomPitch = 12.4,
	.posA = { 0.0, -1.0, 0.0 },
	.posB = { 0.0, -1.0, -500.0 },
	.viewPitch = -16.8,
	.flag = FALSE,
};
	
CameraControlSettings N(IntroCamSettings1) = {
	.type = CAMERA_SETTINGS_TYPE_0,
	.boomLength = 130.4,
	.boomPitch = 12.4,
	.posA = { 0.0, -1.0, 0.0 },
	.posB = { -433.0127, -1.0, -250.0 },
	.viewPitch = -16.8,
	.flag = FALSE,
};

