#include "hos_05.h"
#include "effects.h"
#include "model.h"
#include "nu/nusys.h"
#include "ld_addrs.h"

typedef struct UnkHosStruct {
    /* 0x00 */ s32 unk_00; // entity ID
    /* 0x04 */ IMG_PTR unk_04;
    /* 0x08 */ PAL_PTR unk_08;
    /* 0x0C */ IMG_PTR unk_0C;
    /* 0x10 */ PAL_PTR unk_10;
    /* 0x14 */ char unk_14[0x4];
    /* 0x18 */ IMG_PTR unk_18;
    /* 0x1C */ IMG_PTR unk_1C;
    /* 0x20 */ PAL_PTR unk_20;
    /* 0x24 */ char unk_24[0x18];
    /* 0x3C */ s16 unk_3C;
    /* 0x3E */ s16 unk_3E;
    /* 0x40 */ s16 unk_40;
    /* 0x42 */ s16 unk_42;
    /* 0x44 */ u16 unk_44; // x
    /* 0x46 */ u16 unk_46; // y
    /* 0x48 */ s16 unk_48; // x
    /* 0x4A */ s16 unk_4A; // y
    /* 0x4C */ char unk_4C[0xC];
    /* 0x58 */ s16 unk_58; // bool
    /* 0x5A */ s16 unk_5A;
    /* 0x5C */ s16 unk_5C; // alpha
    /* 0x60 */ char unk_6E[0x2];
} UnkHosStruct; // size = 0x60

s32 N(missing_802494FC_94FC)[] = {
    0x00000064, 0x00000063, 0x00000062, 0x00000060, 0x0000005E, 0x0000005C, 0x00000059, 
    0x00000057, 0x00000054, 0x00000051, 0x0000004F, 0x0000004E, 0x0000004D, 0x0000004D, 0x0000004C, 
    0x0000004C, 0x0000004C, 0x0000004C, 0x0000004D, 0x0000004D, 0x0000004E, 0x0000004E, 0x0000004F, 
    0x0000004F, 0x00000050, 0x00000050, 0x00000051, 0x00000051, 0x00000052, 0x00000052, 0x00000053, 
    0x00000053, 0x00000054, 0x00000054, 0x00000055, 0x00000055, 0x00000056, 0x00000056, 0x00000057, 
    0x00000057, 0x00000058, 0x00000058, 0x00000059, 0x00000059, 0x0000005A, 0x0000005B, 0x0000005C, 
    0x0000005D, 0x0000005E, 0x0000005F, 0x00000060, 0x00000061, 0x00000062, 0x00000063, 0x00000064, 
};

s32 N(D_802495DC_A3381C) = 0;

s32 N(D_802495E0_A33820) = 0;

CameraControlSettings N(IntroCamSettings0) = { // [0] 802495E4
	.type = CAMERA_SETTINGS_TYPE_0,
	.boomLength = 130.4,
	.boomPitch = 12.4,
