
#include "nok_04.h"
#include "effects.h"
#include "sprite/player.h"

#define NUM_THREAD_SEGMENTS 16

typedef struct FuzzyThread {
    /* 0x00 */ Vec3f anchorPos;
    /* 0x0C */ f32 targetLength;
    /* 0x10 */ f32 curLength;
    /* 0x14 */ f32 overshootVel;
    /* 0x18 */ f32 targetAngle;
    /* 0x1C */ f32 overshootAngleVel;
    /* 0x20 */ f32 curAngle;
    /* 0x24 */ Vec3f endPoint;
    /* 0x30 */ f32 duration;
    /* 0x34 */ f32 time;
    /* 0x38 */ f32 lengthStep;
    /* 0x3C */ f32 angleStep;
    /* 0x40 */ Npc* frontNpc;
    /* 0x44 */ Npc* backNpc;
} FuzzyThread; //size = 0x48

#include "world/common/util/ChangeNpcToPartner.inc.c"

#include "world/common/enemy/Fuzzy.inc.c"
#include "world/common/npc/Koopa.inc.c"

#include "../common/GetIntoShell.inc.c"

FuzzyThread N(ThreadData) = {};

s32 N(TreeHidingSpotPositions)[] = {
    -82, 101, 130,
    38, 164, 130,
    158, 135, 157,
    281, 156, 202,
};

#include "common/CosInterpMinMax.inc.c"

EvtScript N(EVS_AnimBranch_JumpTo) = {
    EVT_SET(LVar2, LVar0)
    EVT_SET(LVar3, LVar1)
    EVT_SET(LVar4, 600)
    EVT_DIV(LVar4, 100)
    EVT_ADD(LVar4, 27)
    EVT_CALL(RandInt, 1, LVar5)
    EVT_MUL(LVar5, 20)
    EVT_SUB(LVar5, 10)
    EVT_SET(LVar6, 0)
    EVT_SETF(LVar8, EVT_FLOAT(5.0))
    EVT_CALL(MakeLerp, LVar5, 0, LVar4, EASING_COS_FAST_OVERSHOOT)
    EVT_LABEL(0)
        EVT_CALL(UpdateLerp)
        EVT_MULF(LVar0, EVT_FLOAT(0.40625))
        EVT_ADD(LVar6, 1)
        EVT_SETF(LVar9, LVar8)
        EVT_MULF(LVar9, EVT_FLOAT(-1.0))
