
#include "nok_04.h"
#include "effects.h"

typedef struct Unk80241440_2 {
    /* 0x00 */ f32 unk_00;
    /* 0x04 */ f32 unk_04;
    /* 0x08 */ f32 unk_08;
    /* 0x0C */ f32 unk_0C;
    /* 0x10 */ f32 unk_10;
    /* 0x14 */ f32 unk_14;
    /* 0x18 */ f32 unk_18;
    /* 0x1C */ f32 unk_1C;
    /* 0x20 */ f32 unk_20;
    /* 0x24 */ f32 unk_24;
    /* 0x28 */ f32 unk_28;
    /* 0x2C */ f32 unk_2C;
    /* 0x30 */ f32 unk_30;
    /* 0x34 */ f32 unk_34;
    /* 0x38 */ f32 unk_38;
    /* 0x3C */ f32 unk_3C;
    /* 0x40 */ f32 unk_40;
} Unk80241440_2; //size = 0x44

typedef struct Unk80241440 {
    /* 0x00 */ Vec3f unk_00;
    /* 0x0C */ f32 unk_0C;
    /* 0x10 */ f32 unk_10;
    /* 0x14 */ f32 unk_14;
    /* 0x18 */ f32 unk_18;
    /* 0x1C */ f32 unk_1C;
    /* 0x20 */ f32 unk_20;
    /* 0x24 */ f32 unk_24;
    /* 0x28 */ f32 unk_28;
    /* 0x2C */ f32 unk_2C;
    /* 0x30 */ f32 unk_30;
    /* 0x34 */ f32 unk_34;
    /* 0x38 */ f32 unk_38;
    /* 0x3C */ f32 unk_3C;
    /* 0x40 */ Unk80241440_2* unk_40;
    /* 0x44 */ Unk80241440_2* unk_44;
} Unk80241440; //size = 0x48

/*
trees in this room are labeled with a 0 through 5 system, meaning there are "6" tree values
(tree indexes from left to right in both rows, each tree has 2 unique numbers besides 0)
0, 1, 2, 3
0, 5, 4, 3
*/

#include "world/common/util/ChangeNpcToPartner.inc.c"

NpcSettings N(NpcSettings_Fuzzy_02) = {
    .height = 20,
    .radius = 22,
    .level = 6,
    .onHit = &EnemyNpcHit,
    .onDefeat = &EnemyNpcDefeat,
};

NpcSettings N(NpcSettings_Kooper_01) = {
    .height = 35,
    .radius = 24,
    .level = 99,
    .actionFlags = AI_ACTION_LOOK_AROUND_DURING_LOITER,
};

EvtScript N(D_80241328_9EEF18) = {
    EVT_CALL(GetNpcYaw, LVar4, LVar1)
    EVT_SET(LVar2, 30)
    EVT_IF_GT(LVar1, 151)
        EVT_IF_LE(LVar1, 331)
            EVT_SET(LVar2, -30)
        EVT_END_IF
    EVT_END_IF
    EVT_SET(LVar0, 0)
    EVT_LOOP(15)
        EVT_ADD(LVar0, LVar2)
        EVT_CALL(SetNpcRotation, LVar3, 0, 0, LVar0)
