#include "common.h"
#include "ld_addrs.h"

typedef struct {
    /* 0x00 */ u8 arrayIdx;
    /* 0x01 */ u8 meshType;
    /* 0x02 */ u8 renderType;
    /* 0x03 */ u8 subdivX;
    /* 0x04 */ u8 subdivY;
    /* 0x05 */ s8 unk_05;
    /* 0x06 */ s8 unk_06;
    /* 0x07 */ char unk_07[0x1];
    /* 0x08 */ u16 firstVtxIdx;
    /* 0x0A */ u16 lastVtxIdx;
    /* 0x0C */ s16 unk_0C;
    /* 0x0E */ s16 unk_0E;
    /* 0x10 */ s16 unk_10;
    /* 0x14 */ s32 flags;
    /* 0x18 */ char unk_18[0x4];
    /* 0x1C */ s32 unk_1C[2][4];
    /* 0x3C */ f32 unk_3C[2][4];
    /* 0x5C */ u8* buf;
    /* 0x60 */ u16 bufSize;
    /* 0x62 */ char unk_62[0x2];
    /* 0x64 */ s32* unk_64;
    /* 0x68 */ s32* unk_68[2];
    /* 0x70 */ s32* unk_70[2];
    /* 0x78 */ s32 unk_78;
} FoldState; // size = 0x7C

typedef struct FoldDataCache {
    /* 0x00 */ s32* data;
    /* 0x04 */ u8 staleCooldownTimer;
    /* 0x05 */ u8 usingContextualHeap;
    /* 0x06 */ char unk_06[0x2];
} FoldDataCache; // size = 0x8

typedef struct FoldImageRec {
    /* 0x00 */ s8* raster;
    /* 0x04 */ s8* palette;
    /* 0x08 */ u16 width;
    /* 0x0A */ u16 height;
    /* 0x0C */ s16 xOffset;
    /* 0x0E */ s16 yOffset;
    /* 0x10 */ u8 unk_10;
    /* 0x11 */ char unk_11[0x7];
    /* 0x18 */ s16 unk_18;
    /* 0x1A */ char unk_1A[0x4];
    /* 0x1E */ s16 unk_1E;
    /* 0x20 */ char unk_20[0x4];
    /* 0x24 */ u8 alphaMultiplier;
} FoldImageRec; // size = 0x25

typedef struct FoldGfxDescriptor {
    /* 0x00 */ Vtx* vtx;
    /* 0x04 */ Gfx* gfx;
    /* 0x08 */ u16 vtxCount;
    /* 0x0A */ u16 gfxCount;
    /* 0x0C */ s8 unk_0C;
    /* 0x0D */ s8 unk_0D;
    /* 0x0E */ s8 unk_0E;
    /* 0x0F */ s8 unk_0F;
} FoldGfxDescriptor; // size = 0x10

typedef struct FoldRenderMode {
    /* 0x0 */ s32 mode1;
    /* 0x4 */ s32 mode2;
    /* 0x8 */ u8 flags; // only checks TRUE so far. some kind of switch?
} FoldRenderMode; // size = 0xC

typedef FoldState FoldStateList[90];

// BSS
extern FoldImageRec D_80156920;
extern Vtx* D_80156948[2];
extern Vtx* fold_vtxBuf;
extern FoldStateList* D_80156954;
extern s8 D_80156958[2];
extern s32 D_80156960[2];
extern s32 D_80156968[2];
extern s8 D_80156970;
extern FoldGfxDescriptor fold_groupDescriptors[4];

// Data
FoldImageRec* fold_currentImage = &D_80156920;

u16 fold_vtxCount = 0;

Lights2 D_8014EE18 = {
    .a = {
        .l = {
            .col = { 144, 144, 144 },
            .colc = { 144, 144, 144 },
        }
    },
    .l = {
        {
            .l = {
                .col = { 255, 255, 255 },
                .colc = { 255, 255, 255 },
                .dir = { 0, 0, 120}
            }
        }, {
            .l = {
                .col = { 255, 255, 255 },
                .colc = { 255, 255, 255 },
                .dir = { 0, 0, 136}
            }
        }
