#include "mgm_02.h"
#include "hud_element.h"
#include "effects.h"
#include "model.h"

void startup_draw_prim_rect_COPY(s16 left, s16 top, s16 right, s16 bottom, u16 r, u16 g, u16 b, u16 a);

extern HudScript HudScript_BlueMeter[];
extern HudScript HudScript_AButton[];
extern HudScript HudScript_MashAButton[];

extern s32 D_8024273C_E184BC[3][35]; /* configurations */
extern s32 D_802428E0_E18660[35]; /* model IDs */
extern s32 D_8024296C_E186EC[35]; /* collider IDs */
extern s32 D_802429F8_E18778[10]; /* panel model IDs */
extern s32 D_80248600[10]; /* bss */

extern s32 D_802482A0_E1E020;
extern s32 D_802484A0_E1E220;

extern s32 D_802EAFDC; // SIGNPOST
extern s32 D_80242A3C_E187BC[];

#define SCOREKEEPER_ENEMY_IDX 0
#define SMASH_DATA_VAR_IDX 0

#define PLAY_COST 10
#define PLAY_TIME 900

typedef enum SmashGameBoxCotent {
    BOX_CONTENT_FUZZY   = 0,
    BOX_CONTENT_BOMB    = 1,
    BOX_CONTENT_PEACH   = 2,
    BOX_CONTENT_EMPTY   = 3
} SmashGameBoxCotent;

// TODO: sort these out... something wrong
typedef enum SmashGameBoxState {
    BOX_STATE_FUZZY_INIT    = 0xD,
    BOX_STATE_BOMB_INIT     = 0x21,
    BOX_STATE_EMPTY_INIT    = 0x34,
    BOX_STATE_PEACH_INIT    = 0x49,
} SmashGameBoxState;

typedef struct SmashGameBoxData {
/* 0x00 */ s32 state;
/* 0x04 */ s32 stateTimer;
/* 0x08 */ s32 content;
/* 0x0C */ s32 modelID;
/* 0x10 */ s32 colliderID;
/* 0x14 */ s32 npcID;
/* 0x18 */ s32 unk_18;
} SmashGameBoxData; /* size = 0x1C */

typedef struct SmashGameData {
/* 0x000 */ s32 workerID;
/* 0x004 */ s32 found;
/* 0x008 */ s32 timeLeft; /* frames = 30 * seconds */
/* 0x00C */ s32 hudElemID_AButton;
/* 0x010 */ s32 hudElemID_Meter;
/* 0x014 */ s32 windowA_posX;
/* 0x018 */ s32 windowB_posX;
/* 0x01C */ s32 signpostEntity; /* unk entity */
/* 0x020 */ s32 currentScore;
/* 0x024 */ s32 mashProgress;
/* 0x028 */ s32 mashFlags;
/* 0x02C */ SmashGameBoxData arr[35];
} SmashGameData; /* size = 0x400 */

/* N(draw_score_display) */
void func_80240000_E15D80(void) {
    Enemy* scorekeeper = get_enemy(0);
    SmashGameData* data = (SmashGameData*)scorekeeper->varTable[0];
    s32 hudElemA;
    s32 hudElemMeter;
    s32 timeLeft;
    s32 seconds;
    s32 deciseconds;

    // show mash meter while grabbed by a fuzzy
    if ((data->mashFlags & 4)) {
        hudElemA = data->hudElemID_AButton;
        hud_element_set_render_pos(hudElemA, 90, 90);
        hud_element_draw_clipped(hudElemA);
        hudElemMeter = data->hudElemID_Meter;
        hud_element_set_render_pos(hudElemMeter, 90, 120);
        hud_element_draw_clipped(hudElemMeter);
        startup_draw_prim_rect_COPY(62, 116, 62 + (s32)(((f32)data->mashProgress / 12.0) * 59.0), 116 + 5, 0, 228, 134, 255);
    }

   if (scorekeeper->varTable[3] == 0 || scorekeeper->varTable[3] >= 4) {
        if (data->windowA_posX > -80) {
